app/controllers/pads_controller.rb

  def index
    @pads = Pad.all(:order => "created_at DESC")
---
SELECT * FROM "pads" ORDER BY created_at DESC