app/controllers/pads_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def find_user
    @user = User.find(session[:user_id])